tools/artillery/ga.yaml
config:
  target: https://g.unkey.org
  phases:
    - name: Ramp
      duration: 15m
      arrivalRate: 1
      rampTo: 100
    

  
    # - name: Hold
    #   duration: 60m
    #   arrivalRate: 10
    # - name: Spike Up
    #   duration: 10m
    #   arrivalRate: 10
    #   rampTo: 100
    # - name: Spike Down
    #   duration: 10m
    #   arrivalRate: 100
    #   rampTo: 10
    # - name: Sustain
    #   duration: 3h
    #   arrivalRate: 5

scenarios:
  - flow:
    - post:
        url: "/v1/liveness"
        expect:
          - statusCode: 200