tools/artillery/keys.verifyKey.yaml
config:

  target: https://api.unkey.dev
  phases:
    - name: Ramp up
      duration: 1m
      arrivalRate: 1
      rampTo: 50
    - name: Sustain
      duration: 4m
      arrivalRate: 50
      rampTo: 50
  
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    expect: {}

  ensure:
      thresholds:
        - http.response_time.p50: 50
        - http.response_time.p90: 250
        - http.response_time.p99: 500

scenarios:
  - flow:
      - post:
          url: "/v1/keys.verifyKey"
          json:
            key: "{{ $env.UNKEY_KEY }}"
          capture:
            - json: "$.valid"
              as: valid
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: valid
            - equals:
              - "true"
              - "{{ valid }}"