tools/artillery/keys.verifyKey.yaml
config:
  target: https://api.unkey.dev
  phases:
    - name: Sustain
      duration: 10m
      arrivalRate: 100
  payload:
    path: './.keys.csv'
    fields:
      - key

  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    expect: {}

  ensure:
    thresholds:
      - http.response_time.p50: 300
      - http.response_time.p90: 500
      - http.response_time.p99: 1000

scenarios:
  - flow:
    - post:
        url: "/v1/keys.verifyKey"
        json:
          key: "{{ key }}"
        capture:
          - json: "$.valid"
            as: valid
          - json: "$.code"
            as: code
        expect:
          - statusCode: 200
          - contentType: json
          - hasProperty:
          - equals:
              - "VALID"
              - "{{ code }}"