tools/artillery/leak.yaml
config:
  target: https://bounce.unkey.workers.dev
  phases:
    - name: Ramp
      duration: 30m
      arrivalRate: 10
          

plugins:
    ensure: {}
    expect: {}
    apdex: {}

scenarios:
  - flow:
    - post:
        url: "/ratelimit.v1.RatelimitService/Ratelimit"
        method: "POST"
        headers:
          "Content-Type": "application/json"
          "Authorization": "Bearer {{ $env.AGENT_AUTH_TOKEN}}"
        json:
          identifier: "test"
          limit: 10
          duration: 60000
        capture:
          - json: "$.success"
            as: success
        expect:
          - statusCode: 200
          - contentType: json
          - hasProperty: success