tools/artillery/llm.yaml
config:
  target: https://hello-world.llm.unkey.io 
  phases:
    - name: Ramp
      duration: 10m
      arrivalRate: 1
      rampTo: 50
      
  payload:
      path: './prompts.csv'
      fields:
        - prompt
    

plugins:
    ensure: {}
    expect: {}
    apdex: {}

scenarios:
  - flow:
    - post:
        url: "/v1/chat/completions"
        method: "POST"
        headers:
          "Content-Type": "application/json"
          "Authorization": "Bearer {{ $env.OPENAI_API_KEY}}"
        json:
          model: "gpt-4o"
          temperature: 0.7
          messages: 
            - role: "user"
              content: "{{ prompt }}"
        capture:
        - header: "unkey-cache"
          as: "cache"
      
        expect:
          - statusCode: 200
          - headerEquals:
            - unkey-cache
            - "HIT"