tools/artillery/llm.yaml
config:
  target: https://hello-world.llm.unkey.io 
  phases:
    - name: Ramp
      duration: 1m
      arrivalRate: 1
      rampTo: 1
    

  

scenarios:
  - flow:
    - post:
        url: "/v1/chat/completions"
        method: "POST"
        headers:
          "Content-Type": "application/json"
          "Authorization": "Bearer {{ $env.OPENAI_API_KEY}}"
        json:
          model: "gpt-3.5-turbo"
          temperature: 0.7
          messages: 
            - role: "user"
              content: "Hello I'm andreas, who are you?"
        capture:
        - header: "unkey-cache"
          as: "cache"
      
        expect:
          - statusCode: 200
          - headerEquals:
            - unkey-cache
            - "HIT"