tools/artillery/ratelimit.limit.yaml
config:
  target: https://api.unkey.com
  phases:
    - name: Ramp
      duration: 10m
      arrivalRate: 10
      rampTo: 1000
  payload:
    path: "./.identifiers.csv"
    fields:
      - identifier

  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    expect: {}

  ensure:
    thresholds:
      - http.response_time.p50: 10
      - http.response_time.p90: 25
      - http.response_time.p99: 50

scenarios:
  - flow:
      - post:
          url: "/v2/ratelimit.limit"
          headers:
            Authorization: "Bearer unkey_XXXX"
            Content-Type: application/json
          json:
            namespace: artillery-aws
            identifier: "{{ identifier }}"
            limit: 1000
            duration: 60000
          capture:
            - json: "$.data.success"
              as: success
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty:
            - equals:
                - true
                - "{{ success }}"