tools/artillery/server.yaml
config:
  target: https://latency-benchmarks.unkey.workers.dev
  phases:
    - name: Ramp up
      duration: 5m
      arrivalRate: 1
      rampTo: 50
    # - name: Hold
    #   duration: 60m
    #   arrivalRate: 10
    # - name: Spike Up
    #   duration: 10m
    #   arrivalRate: 10
    #   rampTo: 100
    # - name: Spike Down
    #   duration: 10m
    #   arrivalRate: 100
    #   rampTo: 10
    # - name: Sustain
    #   duration: 3h
    #   arrivalRate: 5

scenarios:
  - flow:
    - post:
        url: "/"
        method: "POST"
        json:
          - name: "aws-ga"
            url: "https://g.unkey.org/v1/liveness"
          - name: "aws-route53"
            url: "https://r.unkey.org/v1/liveness"
          - name: "aws-us-east-1"
            url: "https://api-bjj04s9.fctl.app/v1/liveness"
          - name: "koyeb-global"
            url: "https://rich-mela-unkey-95820a9c.koyeb.app/v1/liveness"
          - name: "koyeb-us-east-1"
            url: "https://grubby-christabella-unkey-4e61f00b.koyeb.app/v1/liveness"
        expect:
          - statusCode: 200