tools/artillery/tinybird-proxy.yaml
config:

  target: https://unkey-events-chronark.koyeb.app
  phases:
    - name: Ramp up
      duration: 5m
      arrivalRate: 1
      rampTo: 100
    - name: Sustain
      duration: 15m
      arrivalRate: 100
      rampTo: 100
   
  
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    expect: {}


scenarios:
  - flow:
      - post:
          url: "/v0/events?name=xxx_test_load_rng" 
          headers:
            Authorization: "Bearer {{$env.AUTHORIZATION}}"
          expect:
            - statusCode: 200
          body: |
            { "a": "{{ $randomString() }}", "b": "{{ $randomString() }}", "c": "{{ $randomString() }}" }